OpenFOAM case folders/Experimental validation/Static drift/FoilShipSharp/T0.22_Fr0.2_alpha2.5/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "constant";
	object      dynamicMeshDict;
}

dynamicFvMesh       dynamicMotionSolverFvMesh;
motionSolverLibs    ("libsixDoFRigidBodyMotion.so");
solver              sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
	patches                   (hull deck trailingEdge);
	innerDistance             0.22000000000000003;
	outerDistance             2.2;
	centreOfMass              (-0.278734454 0.012169809 0.000000000);
	mass                      458.08735;
	momentOfInertia           (20.928827629 740.895210312 758.128799984);
	rhoInf                    1;
	report                    on;
	reportToFile              on;
	value                     uniform (0 0 0);
	accelerationRelaxation    0.4;
	accelerationDamping       0.9;
	solver
	{
		type    Newmark;
	}
	constraints
	{
		zAxis
		{
			sixDoFRigidBodyMotionConstraint    line;
			direction                          (0 0 1);
		}
		yPlane
		{
			sixDoFRigidBodyMotionConstraint    axis;
			axis                               (0.043619 0.999048 0);
		}
	}
	restraints
	{
		translationDamper
		{
			sixDoFRigidBodyMotionRestraint    linearDamper;
			coeff                             17100.014281196356;
		}
		rotationDamper
		{
			sixDoFRigidBodyMotionRestraint    sphericalAngularDamper;
			coeff                             28300.308460200275;
		}
	}
}

